import 'package:lyriverse/lyric/data/dto/lyric_dto.dart';

final List<LyricDto> lyricDtoFixtures = [
  const LyricDto(
    id: 1,
    name: 'Last Dance',
    trackName: 'Last Dance',
    artistName: 'BigBang',
    albumName: 'MADE',
    plainLyrics:
        '영원할 줄 알았던\n사랑도 저물고\n이젠 그 흔한 친구마저\n떠나가네요\n나이가 들어서 나\n어른이 되나 봐요\n왜 이렇게 불안할까\n\n사람들은 오늘도\n과거에 머물고\n세상은 나 없이도\n잘 돌아가네요\n아직은 어려서 나\n철이 안 드나 봐요\n왜 이렇게 바보 같을까\n\n아무것도 없이\n그저 행복해하던 때가\n엊그제 같은데\n그래 너무 멀리\n와버렸어 난\n기억이 안 나\n\n모든 게 처음이라 서툴고\n설레이기만 해\n그 시절 기억들이\n아직도 꿈만 같은데 난\n지금 어디로 가는지\n\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n희미한 불빛이 되어\n별들 사이로\n너 또한 이 별이 되어\n손짓하네요\n혼자가 되어서 나\n외로워 보이나요\n왜 이렇게 눈물이 날까\n\n아무것도 없이\n그저 행복해하던 때가\n엊그제 같은데 그래\n너무 멀리 와버렸어 난\n기억이 안 나\n\n모든 게 처음이라 서툴고\n설레이기만 해\n그 시절 기억들이\n아직도 꿈만 같은데 난\n지금 어디에 있는지\n\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n음악은 계속해서 흐르고\n여기 너를 기다리고 있는\n나에게 기회를 줘\n제발 단 한 번만\n부디 약속할게\n그리 길지는 않을 테니\n\n나는 이 노랠 부르며\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n너와 손을 잡고\n춤을 추던 어젯밤\n찬란히 빛이 나는\n아름다운 One last smile\n빨주노초\n알 수 없던 황홀경\n내가 보고 느끼던\n세상과는 안 어울려\n\n너와 손을 잡고\n춤을 추던 어젯밤\n찬란히 빛이 나는\n아름다운 One last smile\n빨주노초\n알 수 없던 황홀경\n내가 보고 느끼던\n세상과는 안 어울려',
  ),
  const LyricDto(
    id: 2,
    name: 'Still Life',
    trackName: 'Still Life',
    artistName: 'BigBang',
    albumName: 'MADE',
    plainLyrics:
        '영원할 줄 알았던\n사랑도 저물고\n이젠 그 흔한 친구마저\n떠나가네요\n나이가 들어서 나\n어른이 되나 봐요\n왜 이렇게 불안할까\n\n사람들은 오늘도\n과거에 머물고\n세상은 나 없이도\n잘 돌아가네요\n아직은 어려서 나\n철이 안 드나 봐요\n왜 이렇게 바보 같을까\n\n아무것도 없이\n그저 행복해하던 때가\n엊그제 같은데\n그래 너무 멀리\n와버렸어 난\n기억이 안 나\n\n모든 게 처음이라 서툴고\n설레이기만 해\n그 시절 기억들이\n아직도 꿈만 같은데 난\n지금 어디로 가는지\n\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n희미한 불빛이 되어\n별들 사이로\n너 또한 이 별이 되어\n손짓하네요\n혼자가 되어서 나\n외로워 보이나요\n왜 이렇게 눈물이 날까\n\n아무것도 없이\n그저 행복해하던 때가\n엊그제 같은데 그래\n너무 멀리 와버렸어 난\n기억이 안 나\n\n모든 게 처음이라 서툴고\n설레이기만 해\n그 시절 기억들이\n아직도 꿈만 같은데 난\n지금 어디에 있는지\n\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n음악은 계속해서 흐르고\n여기 너를 기다리고 있는\n나에게 기회를 줘\n제발 단 한 번만\n부디 약속할게\n그리 길지는 않을 테니\n\n나는 이 노랠 부르며\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n너와 손을 잡고\n춤을 추던 어젯밤\n찬란히 빛이 나는\n아름다운 One last smile\n빨주노초\n알 수 없던 황홀경\n내가 보고 느끼던\n세상과는 안 어울려\n\n너와 손을 잡고\n춤을 추던 어젯밤\n찬란히 빛이 나는\n아름다운 One last smile\n빨주노초\n알 수 없던 황홀경\n내가 보고 느끼던\n세상과는 안 어울려',
  ),
  const LyricDto(
    id: 3,
    name: 'Bang Bang Bang',
    trackName: 'Bang Bang Bang',
    artistName: 'BigBang',
    albumName: 'MADE',
    plainLyrics:
        '영원할 줄 알았던\n사랑도 저물고\n이젠 그 흔한 친구마저\n떠나가네요\n나이가 들어서 나\n어른이 되나 봐요\n왜 이렇게 불안할까\n\n사람들은 오늘도\n과거에 머물고\n세상은 나 없이도\n잘 돌아가네요\n아직은 어려서 나\n철이 안 드나 봐요\n왜 이렇게 바보 같을까\n\n아무것도 없이\n그저 행복해하던 때가\n엊그제 같은데\n그래 너무 멀리\n와버렸어 난\n기억이 안 나\n\n모든 게 처음이라 서툴고\n설레이기만 해\n그 시절 기억들이\n아직도 꿈만 같은데 난\n지금 어디로 가는지\n\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n희미한 불빛이 되어\n별들 사이로\n너 또한 이 별이 되어\n손짓하네요\n혼자가 되어서 나\n외로워 보이나요\n왜 이렇게 눈물이 날까\n\n아무것도 없이\n그저 행복해하던 때가\n엊그제 같은데 그래\n너무 멀리 와버렸어 난\n기억이 안 나\n\n모든 게 처음이라 서툴고\n설레이기만 해\n그 시절 기억들이\n아직도 꿈만 같은데 난\n지금 어디에 있는지\n\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n음악은 계속해서 흐르고\n여기 너를 기다리고 있는\n나에게 기회를 줘\n제발 단 한 번만\n부디 약속할게\n그리 길지는 않을 테니\n\n나는 이 노랠 부르며\n나는 이 노랠 부르며\n너에게 돌아갈 거야\n아름다웠던 그댈\n다시 볼 수 있다면\n너와 이 노랠 들으며\n마지막 춤을 출 거야\n이 순간을 기억해\n언제까지라도\nJust one last dance\n\n너와 손을 잡고\n춤을 추던 어젯밤\n찬란히 빛이 나는\n아름다운 One last smile\n빨주노초\n알 수 없던 황홀경\n내가 보고 느끼던\n세상과는 안 어울려\n\n너와 손을 잡고\n춤을 추던 어젯밤\n찬란히 빛이 나는\n아름다운 One last smile\n빨주노초\n알 수 없던 황홀경\n내가 보고 느끼던\n세상과는 안 어울려',
  ),
];
